{
  "title": "Resume Page",
  "description": [
    {
      "name": "Nicholas Iloba - ",
      "jobTitle": "Front End Developer",
      "objective": "Diligent Front-end developer with over 5 years experience seeking a position where my passion and experience can contribute towards building simple, successful, and memorable user experiences."
    }
  ],
  "Experience": [
    {
      "jobTitle": "Developer",
      "company": "MullenLowe U.S",
      "city": "Boston, MA",
      "year": "Dec, 2017 - Present",
      "duties": [
        "Led front-end development for web projects such as myFuture.com, Todaysmilitary.com, MedicineandtheMilitary.com, museumofincomplete.com and us.mullenlowe.com. Consulted on web creative ideas by providing realistic estimates and developer hours. Collaborated frequently with QA/Project Managers to ensure the highest quality possible. Mentored co-ops which helped ease transition into daily activites within the team."
      ]
    },
    {
      "jobTitle": "UI Developer (Contractor)",
      "company": "Oath, A Verizon Company",
      "city": "Boston, MA",
      "year": "Sep, 2017 - Dec, 2017",
      "duties": [
        "Designed and developed a modern User Interface for a CI/CD application used across data centers. Participated and was aware of all sorts of agile ceremonies (user story grooming, sprint planning, sprint retrospective)."
      ]
    },
    {
      "jobTitle": "Web Developer",
      "company": "TopSpot Internet Marketing",
      "city": "Houston, TX",
      "year": "Apr, 2015 - Jul, 2017",
      "duties": [
        "Collaborated with cross-functional teams (Sales, Designers & Project Managers) to build fully functional responsive websites.Liaised with Project Management team to create accurate budget for new projects and manage scope creep on existing projects.Built over 40 web projects including features such as photo galleries, forms, custom mobile menus, interactive web pages, and interactive google maps.Tested front-end code in multiple browsers to ensure cross-browser compatibility.Performed website deployments from staging environment to production"
      ]
    },
    {
      "jobTitle": "Front-End Developer/Designer",
      "company": "87Concepts",
      "city": "Lagos, Nigeria",
      "year": "Apr, 2013 - Apr, 2015",
      "duties": [
        "Designed, developed and Managed reviewnaija, projectaidfoundation and orangegroup web projects. Used quick sketches and wireframes to sell interface and information architecture decisions to potential clients. Designed flyers, logos, posters, and other material as needed."
      ]
    }
  ],
  "Education": [
    {
      "school": "University of Portsmouth, UK",
      "year": "Dec, 2012",
      "degree": "Msc. Business & Management "
    },
    {
      "school": "University of Portsmouth, UK",
      "year": "July, 2009",
      "degree": "Bsc. Computing"
    }
  ],
  "Personal": [
    {
      "Address": "28 iriving street, Cambridge, MA, 02138",
      "phone": "202-251-7566",
      "email": "nicholas.iloba@gmail.com",
      "linkedin": "//www.linkedin.com/in/nicholas-iloba-38241652/"
    }
  ],
  "skillActions": [
    {
      "items": [
        "Implement websites, landing pages, and applications from concept through deployment, with a responsive, mobile-first approach",
        "Maintaining, optimizing, troubleshooting, and improving websites",
        "Work closely with other team members on the development team"
      ]
    }
  ],
  "skills": [
    "HTML5, CSS3, JavaScript, React, Boostrap, Gatsby, Git, Photoshop, jQuery, Gulp, webpack"
  ]
}
